src/output.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsse:UsernameToken
				wsu:Id="UsernameToken-cf7d72c1-f4cc-417f-a45a-2aba92bb4103">
				<wsse:Username>joe</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<soap:Body>
		<ns1:sayHi xmlns:ns1="http://server.cxf.spring.objService/">
			<arg0 xmlns="http://server.cxf.spring.objService/">tester</arg0>
		</ns1:sayHi>
	</soap:Body>
</soap:Envelope>
